Revit 2024 API
UnitTypeId.CurrencyPerBritishThermalUnit Property
 Cost per British thermal unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CurrencyPerBritishThermalUnit { get; }
Visual Basic
Public Shared ReadOnly Property CurrencyPerBritishThermalUnit As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurrencyPerBritishThermalUnit {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace